# Type Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperty..::..Type Property
AssetProperty Class See Also
---
Returns the type of the AssetProperty
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AssetPropertyType Type { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Type As AssetPropertyType
	Get
```

Visual C++
---
```text
public:
property AssetPropertyType Type {
	AssetPropertyType get ();
}
```

# See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace